app/controllers/mddtransactions_controller.rb

INSERT INTO "mddtransactions" ("target_id", "wallet_id", "transaction_type_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["target_id", 1], ["wallet_id", 1], ["transaction_type_id", 1], ["amount", 1000.0], ["created_at", "2019-05-04 23:26:15.342906"], ["updated_at", "2019-05-04 23:26:15.342906"]]
---
  def transfer
    puts "-----------Transferencia------------"

    if Wallet.has_money(@current_user.id, params[:transfer][:value])
      puts "Tiene el dinero suficiente"
      @transaction = Mddtransaction.new()
      puts @current_user.id
      @transaction.target_id = params[:transfer][:wallet]
      @transaction.wallet_id = @current_user.id
      @transaction.transaction_type_id = 1
      @transaction.amount = params[:transfer][:value]


      if @transaction.save