app/controllers/payments_controller.rb

INSERT INTO "payments" ("service_id", "mddtransaction_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["service_id", 1], ["mddtransaction_id", 6], ["created_at", "2019-05-05 02:49:58.976145"], ["updated_at", "2019-05-05 02:49:58.976145"]]
INSERT INTO "mddtransactions" ("target_id", "wallet_id", "transaction_type_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["target_id", 1], ["wallet_id", 1], ["transaction_type_id", 2], ["amount", 1000.0], ["created_at", "2019-05-05 02:49:58.931673"], ["updated_at", "2019-05-05 02:49:58.931673"]]
---
  def payment
    puts "-----------Payment------------"

    if Wallet.has_money(@current_user.id, params[:payment][:value])
      puts "Tiene el dinero suficiente para pagos"

      @transaction = Mddtransaction.new()
      puts @current_user.id
      #@transaction.target_id = params[:payment][:service]
      @transaction.wallet_id = @current_user.id
      @transaction.transaction_type_id = 2
      @transaction.amount = params[:payment][:value]

      if @transaction.save
        ActiveRecord::Base.transaction do
          @payment = Payment.new
          @payment.service_id = params[:payment][:service]
          @payment.mddtransaction_id = @transaction.id
          Wallet.get_money(@current_user.id, params[:payment][:value])

          if @payment.save