app/controllers/reports_controller.rb

SELECT  "wallets".* FROM "wallets" WHERE "wallets"."user_id" = $1 ORDER BY "wallets"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "wallets" WHERE "wallets"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT payments.*,services.*, mddtransactions.* FROM "mddtransactions" LEFT JOIN payments ON payments.mddtransaction_id = mddtransactions.id LEFT JOIN services ON payments.service_id = services.id WHERE "mddtransactions"."wallet_id" = $1  [["wallet_id", 1]]
SELECT "mddtransactions".* FROM "mddtransactions" WHERE "mddtransactions"."transaction_type_id" = $1 AND "mddtransactions"."target_id" = $2  [["transaction_type_id", 1], ["target_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "mddtransactions" LEFT JOIN payments ON payments.mddtransaction_id = mddtransactions.id WHERE "mddtransactions"."wallet_id" = $1 LIMIT $2  [["wallet_id", 1], ["LIMIT", 1]]
SELECT payments.*, mddtransactions.* FROM "mddtransactions" LEFT JOIN payments ON payments.mddtransaction_id = mddtransactions.id WHERE "mddtransactions"."wallet_id" = $1 ORDER BY "mddtransactions"."created_at" DESC  [["wallet_id", 1]]
---
  def report
    puts "-----------Reporte------------"
    @wallet = Wallet.where(user_id: @current_user.id)
    if !@wallet.empty?
      @wallet = @wallet.first
      @transactions = Mddtransaction.where(wallet_id: @wallet.id).joins("LEFT JOIN payments ON payments.mddtransaction_id = mddtransactions.id").joins("LEFT JOIN services ON payments.service_id = services.id").joins("LEFT JOIN users ON mddtransactions.target_id = users.id").select("users.*,payments.*,services.*, mddtransactions.*").each do |p|
        p['ingress'] = false
      end

      @transactions += Mddtransaction.where(transaction_type_id: 1).where(target_id: @wallet.id).each do |p|
        p['ingress'] = true
      end

      #Order desc
      @transactions = @transactions.sort_by{|e| e[:created_at]}.reverse!

      if !@transactions.empty?