app/controllers/transfers_controller.rb

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "wallets".* FROM "wallets" WHERE "wallets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "wallets".* FROM "wallets" WHERE "wallets"."user_id" = $1 ORDER BY "wallets"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "mddtransactions" ("target_id", "wallet_id", "transaction_type_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["target_id", 2], ["wallet_id", 1], ["transaction_type_id", 1], ["amount", 1000.0], ["created_at", "2019-05-05 04:39:50.249953"], ["updated_at", "2019-05-05 04:39:50.249953"]]
---
  def transfer
    puts "-----------Transferencia------------"

    if User.find(Wallet.find(params[:transfer][:wallet]).user_id).role_id == 1
      if Wallet.has_money(@current_user.id, params[:transfer][:value])
        @wallet = Wallet.where(user_id: @current_user.id).first
        if @wallet.id != params[:transfer][:wallet]
          puts "Tiene el dinero suficiente"
          @transaction = Mddtransaction.new()
          puts @current_user.id
          @transaction.target_id = params[:transfer][:wallet]
          @transaction.wallet_id = @wallet.id
          @transaction.transaction_type_id = 1
          @transaction.amount = params[:transfer][:value]


          if @transaction.save

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "wallets".* FROM "wallets" WHERE "wallets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "wallets".* FROM "wallets" WHERE "wallets"."user_id" = $1 ORDER BY "wallets"."id" ASC LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
INSERT INTO "mddtransactions" ("target_id", "wallet_id", "transaction_type_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["target_id", 2], ["wallet_id", 3], ["transaction_type_id", 1], ["amount", 1000.0], ["created_at", "2019-05-05 04:49:23.362605"], ["updated_at", "2019-05-05 04:49:23.362605"]]
---
  def transferadmin
    puts "-----------Transferencia desde admin------------"

    if User.find(Wallet.find(params[:transfer][:wallet]).user_id).role_id == 1
      puts "-----------1------------"
      if Wallet.has_money(@current_user.id, params[:transfer][:value])
        puts "-----------2------------"
        @wallet = Wallet.where(user_id: @current_user.id).first
        if @wallet.id != params[:transfer][:wallet]
          puts "Tiene el dinero suficiente"
          @transaction = Mddtransaction.new()
          puts @current_user.id
          @transaction.target_id = params[:transfer][:wallet]
          @transaction.wallet_id = @wallet.id
          @transaction.transaction_type_id = 1
          @transaction.amount = params[:transfer][:value]


          if @transaction.save