app/controllers/users_controller.rb

  def signup
    @user = User.new(user_params)
    @user.role_id = 1
    ActiveRecord::Base.transaction do
      if @user.save
        @wallet = Wallet.new
        @wallet.activation_date = DateTime.now.to_date
        @wallet.last_activity_date = DateTime.now.to_date
        @wallet.maximum_value = 10000000
        @wallet.current_value = 1000
        @wallet.user_id = @user.id
        if @wallet.save
---
INSERT INTO "users" ("name", "lastname", "email", "password_digest", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "wallets" ("activation_date", "last_activity_date", "maximum_value", "current_value", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def consult_wallet
    user = User.by_email(params[:wallet][:email])
    if user
      @wallet = Wallet.where(user_id: user.id)
      if !@wallet.empty?
        @wallet = @wallet.first
        user = User.find(@wallet.user_id)
---
SELECT  "wallets".* FROM "wallets" WHERE "wallets"."user_id" = $1 ORDER BY "wallets"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "wallets" WHERE "wallets"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]