app/controllers/wallets_controller.rb

  def currentmoney
    puts @current_user
    if !Wallet.where(user_id: @current_user.id).empty?
---
SELECT  "wallets".* FROM "wallets" WHERE "wallets"."user_id" = $1 ORDER BY "wallets"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "wallets" WHERE "wallets"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]