app/models/wallet.rb

SELECT  1 AS one FROM "wallets" WHERE "wallets"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "wallets".* FROM "wallets" WHERE "wallets"."user_id" = $1 ORDER BY "wallets"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def self.has_money(id, amount)
    @wallet = Wallet.where(user_id: id)
    if !@wallet.empty?
      @wallet = @wallet.first

SELECT  1 AS one FROM "wallets" WHERE "wallets"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "wallets".* FROM "wallets" WHERE "wallets"."user_id" = $1 ORDER BY "wallets"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
UPDATE "wallets" SET "current_value" = $1, "updated_at" = $2 WHERE "wallets"."id" = $3  [["current_value", 0.0], ["updated_at", "2019-05-04 23:34:19.624117"], ["id", 1]]
---
  def self.get_money(id, amount)
    @wallet = Wallet.where(user_id: id)
    if !@wallet.empty?
      @wallet = @wallet.first
      @wallet.current_value -= amount
      if @wallet.save

SELECT  "wallets".* FROM "wallets" WHERE "wallets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "wallets" SET "current_value" = $1, "updated_at" = $2 WHERE "wallets"."id" = $3  [["current_value", 2000.0], ["updated_at", "2019-05-04 23:34:19.634160"], ["id", 2]]
---
  def self.give_money(id, amount)
    @wallet = Wallet.find(id)
    if @wallet
      @wallet.current_value += amount
      if @wallet.save