app/controllers/concerns/secured.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def authenticate_client!
    begin
      obj = auth_token
      @current_user = User.find_by_id(obj["id"])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def authenticate_shop_keeper!
    begin
      obj = auth_token
      @current_user = User.find_by_id(obj["id"])